[
  "Jarrow Formulas L-Carnitine 500 mg, Dietary Supplement, Support for Cellular Energy Production, 100 Veggie Capsules, 100 Day Supply",
  "PYM Attention Chews Support for Procrastination, Focus & Productivity, 20 Count | 518mg L-Carnitine, 54mg Tyrosine, 11mg L-Taurine, Caffeine-Free | All-Natural Mood Boost Supplement Made in USA",
  "Creatine HCL Gummies for Men & Women Sugar-Free, 120 HCL Creatine with Turmeric, Beet Root, Electrolytes gummies for Muscle Strength, Energy, Pre-Workout & Recovery Chewable Gummies, Mixedberry",
  "Ronnie Coleman Signature Series L-Carnitine XS 3000 Liquid, Amino Acids Metabolism and Lean Muscle Strength Support, Stimulant Free, Sugar Free, Zero Carbs, Pink Lemonade, 16 Oz",
  "NOW Foods Supplements, Diet Support with ForsLean® (Coleus forskohlii), 120 Veg Capsules",
  "RSP Nutrition QuadraLean - Stimulant Free Weight Management, Metabolism Booster, Energy & Appetite Support - CLA, L-Carnitine, Green Tea Extract, Non-Stim Formula, 50 Serv (Packaging May Vary)",
  "VitaMonk GlycoTrax - High Absorption GPLC Supplement - No Artificial Fillers - GPLC Glycine Propionyl-L-Carnitine Capsules Supplements to Support Healthy Blood Flow - 60 Capsules",
  "Cellucor C4 Ripped Pre Workout Powder for Energy, Beta Alanine, Sugar Free Energy Supplement Preworkout for Men & Women - 150mg Caffeine + Creatine-Free - ICY Blue Razz - 30 Servings",
  "Nature's Truth L-Carnitine 1000mg | 60 Capsules | Mega Strength | Free Form | Non-GMO & Gluten Free Supplement",
  "NOW Foods L- Carnitine Tartrate 1000mg, 100 Tablets (Pack of 2)",
  "Metagenics L-Carnitine - Amino Acid Supplement to Support Fat Metabolism* - 30 Servings",
  "Now Foods Sports, Liquid L-Carnitine, Citrus, 1,000 mg, 32 fl oz (946 ml)",
  "BulkSupplements.com L-Carnitine Fumarate Powder - Carnitine Supplement, Sports Nutrition, L-Carnitine 500mg - Gluten Free, 500mg per Serving, Gluten Free, 100g (3.5 oz) (Pack of 1)",
  "Earthborn Elements L-Carnitine Tartrate, 200 Capsules, No Magnesium or Rice Fillers, No Additives, Gluten-Free, Undiluted",
  "Bluebonnet Liquid L-Carnitine 1100 mg, Raspberry, 8 Fluid Ounce",
  "GNC Pro Performance L-Carnitine, 60 Tablets, Supports Muscle Recovery",
  "Nepeta Nephro Protein Dialysis Care Nutritional Supplement Powder L-Carnitine for Renal Health – No Added Sugar, Vanilla Flavour 200g",
  "EFX Sports L-Carnitine Liquid 1500mg, Improve Performance and Strength, Vitamin B5 (31 Servings, Fruit Punch)",
  "Now Foods: L-Carnitine Fitness Support 1000mg, 100 tabs",
  "Vital Nutrients Carnitine 500mg | L-Carnitine Supplement for Heart Health Support | Vegan Energy Support Supplement | Gluten, Dairy, Soy Free | Non-GMO | 60 Capsules",
  "Pure Original Ingredients L-Carnitine L-Tartrate (8oz) Powder, Amino Acid Supplement, Lab-Verified",
  "Now Sports - Liquid L-Carnitine (Citrus Flavor) 3000 mg - 16 fl. oz (473 ml) by",
  "VMI Sports L-Carnitine 3000 Powder | 3000 mg L-Carnitine | Metabolic Support Maximum Absorption Formula | Great Taste for Men & Women | 30 Servings (30 Servings, Strawberry Kiwi)",
  "NuSci L-Carnitine Pure Powder Energy (454g (1.0 Lb))",
  "Rooted Owl Metabolism Support - L-Carnitine Supplement for Dogs and Cats to Support Healthy Weight - Dog and Cat Supplement - 60/ct",
  "NOW Foods Sports L-Carnitine Liquid Tropical Punch -- 1000 mg - 16 fl oz",
  "Nefro LP (FKA Nephro LP) Non-Dialysis Care Protein Powder - Low Protein, High Fat Formula Enriched with L-Taurine, L-Carnitine for Kidney/Renal Health, No Added Sugar – Vanilla Flavour$44.90",
  "Nefro LP (FKA Nephro LP) Non-Dialysis Care Protein Powder - Low Protein, High Fat Formula Enriched with L-Taurine, L-Carnitine for Kidney/Renal Health, No Added Sugar – Vanilla Flavour 400g$46.50",
  "Klaire Labs L-Carnitine - 250 Milligrams 100% Pure USP Form to Support Cardiovascular Function & Energy Demands, Hypoallergenic with No D-Carnitine (60 Capsules)",
  "Solgar L-Carnitine 1500 mg Liquid, 16 oz. - Natural Lemon Flavor - Heart Health - Supports Energy, Metabolism, Exercise Endurance & Recovery - Non-GMO, Vegan, Gluten & Dairy Free - About 31 Servings4.3 out of 5 stars 399",
  "L-Carnitine 500 mg 120 Capsules",
  "Designs for Health Carnitine Tartrate Powder - 700mg L-Carnitine Tartrate Supplement - Pleasant, Tart-Tasting Powdered Carnitine Drink Mix - Non-GMO + Vegetarian (100 Servings / 100g)4.3 out of 5 stars 31",
  "BENephro Protein Dialysis Care Nutritional Supplement Powder L-Carnitine for Renal Health – No Added Sugar, Vanilla Flavour 200g$42.99",
  "Designs for Health Ribo-CarniClear Liquid - 2000mg D-Ribose + L-Carnitine with Pantothenic Acid - Vegan - May Support Energy, Muscle Recovery + Heart Health - Orange Flavor (47 Servings / 8 Fl Oz)4.7 out of 5 stars 36",
  "BIOTECH USA L-CARNITINE 70.000 + CHROME Orange by BIOTECH USA5.0 out of 5 stars 1",
  "Nature's Answer Liquid L-Carnitine Natural Raspberry - 16 fl oz",
  "ML Naturals L-Carnitine 1000 mg 360 Capsules. 99.9% Purity L-Carnitine. Supports Energy Production. Fitness Support, NSF-Certified & cGMP-Compliant",
  "L Carnitine Source Naturals, Inc. 60 Caps",
  "Now Foods, Sports, L-Carnitine Liquid, Citrus Flavor, 1000 mg, 32 fl oz (946 ml)",
  "Now Foods L-Carnitine Liquid Citrus Flavor 1000 mg - 16 oz.",
  "Ecological Formulas - L-Carnitine 250 mg 120 caps [Health and Beauty]$57.00",
  "L-Carnitine 500 mg - 180 Veg Capsules by NOW",
  "NOW Foods L-Carnitine 1000 mg Liquid - 32 oz.",
  "Central Coast Garden Products,CCRC2128,Root Cleaner, 1 Gallon Concentrate",
  "NOW Foods L-Carnitine Liquid Tropical Punch 1000 mg - 16 oz.1 offer from $23.59",
  "Now Foods Carnitine 500mg 90 VegCap",
  "100 rikahaaraa",
  "NOW Foods L-Carnitine Liquid, Citrus Flavor 1000 mg - 16 oz.3 offers from $27.81",
  "NOW Foods L-Carnitine Liquid Tropical Punch 1000 mg - 16 oz.",
  "AXENIC 20 Grams Glycine Propionyl L-Carnitine HCl Powder (gplc)2 offers from $7.26"
]